backend_api/app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `token` = 'e11043b57b5a7b9365dd7125fefa37f4c51512e4bab124d109fc30a0fbdd73ab'
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        // Ambil header Authorization
        $authHeader = $request->getHeaderLine('Authorization');

        if (!$authHeader) {
            return service('response')
                ->setJSON(['message' => 'Token tidak ditemukan. Silakan login terlebih dahulu.'])
                ->setStatusCode(401);
        }

        try {
            // Ambil token dari header
            $token = explode(' ', $authHeader)[1] ?? null;

            if (!$token) {
                return service('response')
                    ->setJSON(['message' => 'Format token tidak valid. Gunakan: Bearer <token>'])
                    ->setStatusCode(401);
            }

            // Cek token di database
            $model = new UserModel();
            $user = $model->where('token', $token)->first();