backend_api/app/Controllers/Api/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
UPDATE `users` SET `token` = '37bcbf24c9d13c8b8c5dfcdc7e0dfb43f931c784f7279de139489ec6cc27d59a', `updated_at` = '2026-06-20 13:15:56'
WHERE `users`.`id` IN ('1')
---
    public function login()
    {
        // Ambil data dari request
        $data = $this->request->getJSON(true);

        // Debug
        log_message('debug', 'Login data: ' . json_encode($data));

        if (empty($data['username']) || empty($data['password'])) {
            return $this->fail('Username dan password wajib diisi');
        }

        $model = new UserModel();
        $user = $model->where('username', $data['username'])->first();

        if (!$user) {
            return $this->failUnauthorized('Username tidak ditemukan');
        }

        // Cek password (plain text)
        if ($data['password'] !== $user['password']) {
            return $this->failUnauthorized('Password salah');
        }

        // Generate token
        $token = bin2hex(random_bytes(32));
        $model->update($user['id'], ['token' => $token]);