backend_api/app/Controllers/Api/DashboardController.php

    public function index()
    {
        $bukuModel = new BukuModel();
        $anggotaModel = new AnggotaModel();
        $peminjamanModel = new PeminjamanModel();

        $data = [
            'total_buku' => $bukuModel->countAll(),
            'total_anggota' => $anggotaModel->countAll(),
            'total_peminjaman' => $peminjamanModel->countAll(),
            'peminjaman_aktif' => $peminjamanModel->where('status', 'Dipinjam')->countAllResults(),
            'buku_terbaru' => $bukuModel->orderBy('created_at', 'DESC')->limit(5)->findAll()
---
SELECT COUNT(*) AS `numrows` FROM `anggota`
SELECT COUNT(*) AS `numrows` FROM `peminjaman`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'Dipinjam'
SELECT *
FROM `buku`
ORDER BY `created_at` DESC
 LIMIT 5