backend_api/app/Models/BukuModel.php

    public function getBukuWithKategori()
    {
        return $this->select('buku.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
                    ->findAll();
---
SELECT `buku`.*, `kategori`.`nama_kategori`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`