backend_api/app/Models/PeminjamanModel.php

    public function getPeminjamanWithDetail()
    {
        return $this->select('peminjaman.*, anggota.nama as nama_anggota, buku.judul_buku')
                    ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota')
                    ->join('buku', 'buku.id_buku = peminjaman.id_buku')
                    ->findAll();
---
SELECT `peminjaman`.*, `anggota`.`nama` as `nama_anggota`, `buku`.`judul_buku`
FROM `peminjaman`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`